<template>
  <i class="icon-cls">
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 48 48"><g id="レイヤー_2" data-name="レイヤー 2"><g id="レイヤー_1-2" data-name="レイヤー 1"><path class="cls-1" d="M36.1,44.08H11.9A10.42,10.42,0,0,1,1.5,33.68V14.32A10.42,10.42,0,0,1,11.9,3.92H36.1a10.42,10.42,0,0,1,10.4,10.4V29.69a.73.73,0,0,1-.73.73.73.73,0,0,1-.72-.73V14.32A9,9,0,0,0,36.1,5.37H11.9a9,9,0,0,0-8.95,9V33.68a9,9,0,0,0,9,9H36.1A9,9,0,0,0,45,34.83a.72.72,0,1,1,1.43.18A10.41,10.41,0,0,1,36.1,44.08Z"/><path class="cls-1" d="M29.47,22.27l-8-4.64a2,2,0,0,0-3,1.73v9.28a2,2,0,0,0,3,1.73l8-4.64A2,2,0,0,0,29.47,22.27Z"/><rect class="cls-2" width="48" height="48"/></g></g></svg>
  </i>
</template>
<style lang="scss" scoped>
.cls-1 { fill: #474747; }
.cls-2 { fill: none; }
</style>